# homebrew repositories
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

# ----- ----- ----- -----
# dependencies

# keyboard shortcut daemon
brew "koekeishiya/formulae/skhd"

# node / work related
brew "fnm"
brew "hyperfine"
brew "git"
brew "neovim"

# personal tools
brew "openssh"
brew "yadm"
brew "zoxide"

# misc
brew "neofetch"
brew "ripgrep"
brew  "gnupg"

# ----- ----- ----- -----
# macos applications installed via homebrew

# terminal
cask "alacritty"
# alt-tab windows like
cask "alt-tab"
# cheatsheet app to show shortcuts
cask "cheatsheet"
# nerd font with pretty icons
cask "font-hack-nerd-font"
# window manager
cask "rectangle"
# email client
cask "thunderbird"
# keyboard layout overwrite
cask "ukelele"
# visual code
cask "visual-studio-code"

