# homebrew repositories
tap "homebrew/bundle"

# ----- ----- ----- -----

# node / work related
brew "fnm" # node version manager
brew "git" # version control
brew "neovim" # text editor
brew "lazygit" # git tui

# personal tools
brew "openssh" # ssh command
brew "yadm" # dotfiles manager

# enhanced tools
brew "eza" # enchanced ls command
brew "zoxide" # enhanced cd command

# misc
brew "fastfetch" # system details
brew "gnupg" # encryption and signing
brew "starship" # bash prompt customization

# ----- ----- ----- -----

# fonts
cask "font-hack-nerd-font" # hack nerd font

# usability
cask "alt-tab" # alt-tab windows like
cask "rectangle" # window manager
cask "karabiner-elements" # keyboard mappings
cask "ukelele" # keyboard layout editor

# work related
cask "alacritty" # terminal emulator
cask "visual-studio-code" # visual code
cask "figma" # ux mockups
cask "pingid" # authenticator

# personal tools
cask "google-chrome" # web browser
cask "discord" # chat server
